src/main/resources/xml/accommodationFulfillmentServicePort/createBellServiceRequest/createBellServiceRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:createBellServiceRequest>
         <request>
            <travelPlanId>?</travelPlanId>
            <travelComponentId>?</travelComponentId>
            <travelComponentServiceRequestId>?</travelComponentServiceRequestId>
            <!--Optional:-->
            <locationId>?</locationId>
            <bellServiceRequestDetail>
               <!--Optional:-->
               <bellServiceType>?</bellServiceType>
               <!--Optional:-->
               <guestlocation>?</guestlocation>
               <!--Optional:-->
               <bagSource>?</bagSource>
               <!--Optional:-->
               <bagDestination>?</bagDestination>
               <!--Optional:-->
               <specialInstructions>?</specialInstructions>
               <!--Optional:-->
               <bagQuantity>?</bagQuantity>
               <!--Optional:-->
               <facilityId>?</facilityId>
               <!--Optional:-->
               <toLocationValue>?</toLocationValue>
               <!--Optional:-->
               <fromLocationValue>?</fromLocationValue>
               <!--Optional:-->
               <requestDateTime>?</requestDateTime>
            </bellServiceRequestDetail>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:createBellServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>
